---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.MinColor
source: html/ecb3498d-04b7-02e9-d841-fc233fdd2fe8.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayColorSettings.MinColor Property

Color assigned to the minimum value.

## Syntax (C#)
```csharp
public Color MinColor { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null